#!/bin/bash

# Menampilkan ASCII art dengan warna merah
echo -e "\e[1;31m

 █████╗ ██╗██████╗ ██████╗ ██████╗  ██████╗ ██████╗     ██████╗ ███████╗██████╗ ██╗  ██╗ █████╗ ███╗   ██╗██████╗ 
██╔══██╗██║██╔══██╗██╔══██╗██╔══██╗██╔═══██╗██╔══██╗    ██╔══██╗██╔════╝██╔══██╗██║  ██║██╔══██╗████╗  ██║██╔══██╗
███████║██║██████╔╝██║  ██║██████╔╝██║   ██║██████╔╝    ██████╔╝█████╗  ██║  ██║███████║███████║██╔██╗ ██║██║  ██║
██╔══██║██║██╔══██╗██║  ██║██╔══██╗██║   ██║██╔═══╝     ██╔══██╗██╔══╝  ██║  ██║██╔══██║██╔══██║██║╚██╗██║██║  ██║
██║  ██║██║██║  ██║██████╔╝██║  ██║╚██████╔╝██║         ██║  ██║███████╗██████╔╝██║  ██║██║  ██║██║ ╚████║██████╔╝
╚═╝  ╚═╝╚═╝╚═╝  ╚═╝╚═════╝ ╚═╝  ╚═╝ ╚═════╝ ╚═╝         ╚═╝  ╚═╝╚══════╝╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝╚═════╝ 
                                                                                                                  

"

# Menambahkan teks ajakan di tengah logo dengan penyesuaian warna
echo -e "\n"
echo -e "\e[1;37m      ✨ Welcome to Airdrop Red Left Hand! ✨      "
echo -e "\n"

# Menambahkan ajakan untuk bergabung
echo -e "\e[1;32m             👨‍💻 Join the movement and level up with us on Telegram! 🚀"

# Tautan Telegram Channel dan Group dengan warna cyan
echo -e "\e[1;36m🌍 Channel Telegram: https://t.me/airdropredhand"
echo -e "\e[1;36m💬 Grup Telegram: https://t.me/airdropredhanddiscussion"

# Garis kosong agar lebih rapi
echo -e "\n\n"
